In [2]:
# Import pandas service
import pandas as pd

In [3]:
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [4]:
# Read the school data file and stor it in pandas dataframe
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [5]:
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [6]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [7]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [11]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [12]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [13]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [14]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [15]:
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

student_data_df

C:\Users\dixita1\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The default value of regex will change from True to False in a future version.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [16]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [17]:
student_count = school_data_complete_df.count()
print(student_count)

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [18]:
student_count = school_data_complete_df["Student ID"].count()
print(student_count)

39170

In [19]:
school_count = school_data_complete_df["School ID"].unique()
school_count_len = (len(school_count))
print(school_count_len)

15

In [20]:
budget_sum = school_data_df["budget"].sum()
print(f"Total budget for all schools is ${budget_sum:,}")

Total budget for all schools is $24,649,428

In [21]:
average_reading_score = school_data_complete_df["reading_score"].mean()
print(f"Average reading score of students is {average_reading_score:.2f}")

Average reading score of students is 81.88

In [22]:
average_math_score = school_data_complete_df["math_score"].mean()
print(f"Average math score of students is {average_math_score:.2f}")

Average math score of students is 78.99

In [23]:
passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70
print(passing_math)

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [24]:
students_passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
pass_student_math_count = students_passing_math["Student ID"].count()
print(pass_student_math_count)

29370

In [25]:
students_passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
students_passing_reading["Student ID"].count()

33610

In [26]:
total_student_count = school_data_complete_df["Student ID"].count()
print(total_student_count)

39170

In [27]:
percent_students_passing_math = (students_passing_math["Student ID"].count() / school_data_complete_df["Student ID"].count()) * 100
print(f"Pecentage of students passing math: {percent_students_passing_math:.2f}%")

Pecentage of students passing math: 74.98%

In [28]:
percent_students_passing_reading = (students_passing_reading["Student ID"].count() / school_data_complete_df["Student ID"].count()) * 100
print(f"Pecentage of students passing reading: {percent_students_passing_reading:.2f}%")

Pecentage of students passing reading: 85.81%

In [29]:
students_passing_both = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]
students_passing_both["Student ID"].count()

25528

In [30]:
percent_students_passing_both = (students_passing_both["Student ID"].count() / school_data_complete_df["Student ID"].count()) * 100
print(f"Pecentage of students passing both subjects: {percent_students_passing_both:.2f}%")

Pecentage of students passing both subjects: 65.17%

In [31]:
district_summary_df = pd.DataFrame([{"Total Schools": school_count_len, "Total Students": student_count, "Total Budget": budget_sum, "Avg Reading Score": average_reading_score, "Avg Math Score": average_math_score, "% Passing Reading": percent_students_passing_reading, "% Passing Math": percent_students_passing_math, "% Overall Passing": percent_students_passing_both}])
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,39170,24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [65]:
# Define a function that takes in number of students who passed math and total students and returns the percentage of students who passed maths

def passing_math_percent(pass_math_count, total_student_count):
    percent_students_passed_math = (pass_math_count / total_student_count) * 100
    return(f"{percent_students_passed_math:.2f}")

In [66]:
passing_math_percent(pass_student_math_count, total_student_count)

'74.98'

In [75]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [76]:
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,39170,"$24,649,428.00",81.87784,78.985371,85.805463,74.980853,65.172326

In [32]:
# Format Total Students

district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170",24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [33]:
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170",24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [36]:
# Format budget
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

In [37]:
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.87784,78.985371,85.805463,74.980853,65.172326

In [38]:
# Format Avg Reading Score
district_summary_df["Avg Reading Score"] = district_summary_df["Avg Reading Score"].map("{:.1f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,78.985371,85.805463,74.980853,65.172326

In [39]:
# Format Avg Math Score
district_summary_df["Avg Math Score"] = district_summary_df["Avg Math Score"].map("{:.1f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,85.805463,74.980853,65.172326

In [40]:
# Format % students who passed reading
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,86,74.980853,65.172326

In [41]:
# Format % students who passed math
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,86,75,65.172326

In [42]:
# Format % students who passed overall
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Reading Score,Avg Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,86,75,65

In [44]:
new_column_order = ["Total Schools", "Total Students", "Total Budget", "Avg Math Score", "Avg Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

district_summary_df = district_summary_df[new_column_order]

In [45]:
district_summary_df

,Total Schools,Total Students,Total Budget,Avg Math Score,Avg Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65